# Brewfile
#
# A list of things I use in no particular order

cask_args appdir: "/Applications"

# Fonts
# Collection of fonts that I use for coding

# https://github.com/caskroom/homebrew-fonts
tap "caskroom/fonts"

# https://github.com/tonsky/FiraCode
cask "font-fira-code"

# Aerial Screensaver
# https://github.com/JohnCoates/Aerial
cask "aerial"

# Utils

# Text processing utility
# Used for previews in Terminal when hitting "Ctrl + t"
# http://www.andre-simon.de/doku/highlight/en/highlight.php
brew "highlight"

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"

# A command line tool that can be used for:
#  Creation of key parameters
#  Creation of X.509 certificates, CSRs and CRLs
#  Calculation of message digests
#  Encryption and decryption
#  SSL/TLS client and server tests
#  Handling of S/MIME signed or encrypted mail
# https://github.com/openssl/openssl
brew "openssl"

# A command-line fuzzy finder
# https://github.com/junegunn/fzf
brew "fzf"

# Lightweight and flexible command-line JSON processor
# https://stedolan.github.io/jq/
brew "jq"

# Command line tool that wraps git in order to extend
# it with extra features and commands
# https://github.com/github/hub
brew "hub"

# Library for configuring and customizing font access
# https://www.freedesktop.org/wiki/Software/fontconfig/
brew "fontconfig"

# ngrok exposes local servers behind NATs and firewalls
# to the public internet over secure tunnels.
# https://ngrok.com
cask "ngrok"

# Line-oriented search tool that recursively searches
# your current directory for a regex pattern
# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# Command-line productivity booster
# https://github.com/clvv/fasd
brew "fasd"

# A simple command line interface for the Mac App Store
# https://github.com/mas-cli/mas
brew "mas"

# Tree is a directory lister that shows a tree outline
# https://packages.debian.org/en/wheezy/tree
brew "tree"

# Json Incremental Digger
# https://github.com/simeji/jid
brew "jid"

# Configurable talking cow
# https://github.com/piuccio/cowsay
brew "cowsay"

# Magnificent app which corrects your previous console command
# https://github.com/nvbn/thefuck
brew "thefuck"

# Text-mode interface for git
# https://github.com/jonas/tig
brew "tig"

# OSS graph visualization software
# http://www.graphviz.org
brew "graphviz"

# Functions for use by applications that allow users
# to edit command lines while typing.
brew "readline"

# Misc

# API Documentation Browser
# https://kapeli.com/dash
cask "dash"

# A powerful and stable keyboard customizer for macOS
# https://pqrs.org/osx/karabiner/
cask "karabiner"

# Terminal

# An interactive process viewer for Unix
# http://hisham.hm/htop/
brew "htop"

# A replacement for Terminal and the successor to iTerm
# http://www.iterm2.com
cask "iterm2-nightly"

# tmux is a "terminal multiplexer", it enables a number
# of terminals (or windows) to be accessed and controlled
# from a single terminal.
# https://github.com/tmux/tmux
brew "tmux"

# The future of VIM
# https://neovim.io
brew "nvim"

# A shell designed for interactive use
# http://www.zsh.org
brew "zsh"

# Browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"

# Music
# https://www.spotify.com/
cask "spotify"

# Little Snitch
# https://www.obdev.at/products/littlesnitch/index.html
cask "little-snitch"

# Git Client
# https://www.sourcetreeapp.com
cask "sourcetree"

# Paw.cloud
# https://paw.cloud
cask "paw"

# Organize your menu bar apps, by hiding them,
# rearranging them, or moving them
# https://www.macbartender.com
cask "bartender"

# Powerful file comparison app
# https://kaleidoscopeapp.com
cask "kaleidoscope"

# Code Editor
# https://code.visualstudio.com
cask "visual-studio-code"

# App Store

# Password Manager
# https://1password.com
mas "1Password", id: 443987910

# With Amphetamine, you can effortlessly override your energy
# saver settings and keep your Mac awake.
# https://itunes.apple.com/app/amphetamine/id937984704?mt=12
mas "Amphetamine", id: 937984704

# A simple yet powerful tool for working with regular
# expressions.
# https://krillapps.com/patterns/
mas "Patterns - The Regex App", id: 429449079

# Gorgeous wallpapers on your Mac
# http://irvue.tumblr.com
mas "Irvue", id: 1039633667

# Noizio is an app that will drown out the noise of the street
# and allow you to concentrate on the work at hand, increasing
# your productivity.
# http://noiz.io
mas "Noizio", id: 928871589
