cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "caskroom/cask"
tap "fisherman/tap"
tap "neovim/neovim"

brew "coreutils"
brew "fish"
brew "fisherman"
brew "fontconfig"
brew "fzf"
brew "go"
brew "graphviz"
brew "hub"
brew "jq"
brew "fontconfig"
brew "neovim"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "yarn"

cask "1password"
cask "alfred"
cask "bartender"
cask "boom"
cask "cloak"
cask "dash"
cask "fantastical"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-hangouts"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
cask "numi"
cask "omnifocus"
cask "paw"
cask "rescuetime"
cask "slack"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
